Lets Begin

#### What Is SQLAlchemy?

SQLAlchemy is a Python SQL toolkit and **Object Relational Mapper** (ORM).
- It allows you to talk to your database (like MySQL, PostgreSQL, SQLite, etc.) using Python code instead of raw SQL.

It gives you two layers:
- Core → For writing SQL-like queries but in Python syntax.
- ORM (Object Relational Mapper) → For working with classes and objects instead of tables and rows.

In [22]:
from sqlalchemy import create_engine, text
engine = create_engine("mysql+pymysql://root:Harman%40123@localhost/Datasets")

In [23]:
with engine.connect() as conn:
    result = conn.execute(text("SELECT 1"))
    print(result.scalar())

1

Why use text() and :sal?

It prevents SQL injection.

It makes queries parameterized and secure.

In [113]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text


engine = create_engine("mysql+pymysql://root:Harman%40123@localhost/Datasets")


def run_query(query):
    """Run SELECT queries and return DataFrame (ignores --sql line)"""
    if query.strip().startswith("--sql"):
        query = "\n".join(query.splitlines()[1:]) 
    return pd.read_sql(query, engine)


def run_command(query):
    """
    Execute INSERT/UPDATE/DELETE/CREATE queries using SQLAlchemy
    """
    with engine.begin() as conn:  
        if query.strip().startswith("--sql"):
            query = "\n".join(query.splitlines()[1:])
        conn.execute(text(query)) 
        print("Query executed successfully")

In [ ]:
dept_creation = '''
CREATE TABLE departments (
    dept_id INT PRIMARY KEY AUTO_INCREMENT,
    dept_name VARCHAR(100) NOT NULL,
    manager_id INT,
    budget DECIMAL(12,2),
    location VARCHAR(100)
);
'''

dept_insert = '''
INSERT INTO departments (dept_name, manager_id, budget, location) VALUES
('Engineering', 101, 5000000, 'New York'),
('Finance', 102, 2500000, 'Chicago'),
('Human Resources', 103, 1200000, 'Boston'),
('Marketing', 104, 2000000, 'San Francisco'),
('Data Science', 105, 4000000, 'Seattle');
'''

emp_creation = '''
CREATE TABLE employees (
    emp_id INT PRIMARY KEY AUTO_INCREMENT,
    emp_name VARCHAR(100),
    gender ENUM('M','F'),
    hire_date DATE,
    salary DECIMAL(10,2),
    dept_id INT,
    designation VARCHAR(50),
    performance_rating INT,
    FOREIGN KEY (dept_id) REFERENCES departments(dept_id)
);
'''

emp_insert = '''
INSERT INTO employees (emp_name, gender, hire_date, salary, dept_id, designation, performance_rating) VALUES
('Harman Talwar', 'M', '2019-06-10', 85000, 1, 'Backend Engineer', 5),
('Sahil Kapoor', 'M', '2021-03-15', 65000, 1, 'Frontend Developer', 4),
('Neha Sharma', 'F', '2020-08-20', 72000, 5, 'Data Analyst', 3),
('Priya Nair', 'F', '2018-01-12', 95000, 2, 'Finance Lead', 5),
('Rohan Mehta', 'M', '2022-05-23', 60000, 3, 'HR Associate', 4),
('Aditi Singh', 'F', '2020-09-09', 88000, 1, 'DevOps Engineer', 4),
('Rahul Verma', 'M', '2017-04-02', 110000, 1, 'Tech Lead', 5),
('Kavita Joshi', 'F', '2019-11-18', 78000, 4, 'Marketing Specialist', 3),
('Arjun Patel', 'M', '2022-07-01', 55000, 3, 'Recruiter', 2),
('Vanshika Rao', 'F', '2021-01-25', 82000, 5, 'ML Engineer', 4);
'''

projects_creation = '''
CREATE TABLE projects (
    project_id INT PRIMARY KEY AUTO_INCREMENT,
    project_name VARCHAR(100),
    start_date DATE,
    end_date DATE,
    budget DECIMAL(12,2),
    dept_id INT,
    lead_id INT,
    status ENUM('Ongoing', 'Completed', 'On Hold'),
    FOREIGN KEY (dept_id) REFERENCES departments(dept_id),
    FOREIGN KEY (lead_id) REFERENCES employees(emp_id)
);
'''

project_insertion = '''
INSERT INTO projects (project_name, start_date, end_date, budget, dept_id, lead_id, status) VALUES
('E-Commerce Revamp', '2023-01-01', NULL, 1500000, 1, 7, 'Ongoing'),
('Payroll Automation', '2022-03-01', '2023-01-31', 800000, 2, 4, 'Completed'),
('Recruitment Portal', '2025-08-15', NULL, 400000, 3, 5, 'Ongoing'),
('Ad Campaign 2023', '2023-02-01', '2023-05-15', 500000, 4, 8, 'Completed'),
('Customer Segmentation', '2023-04-10', NULL, 1200000, 5, 10, 'Ongoing');
'''

run_command(dept_creation)
run_command(dept_insert)
run_command(emp_creation)
run_command(emp_insert)
run_command(projects_creation)
run_command(project_insertion)

# print(query)

In [9]:
run_query("SHOW DATABASES")

             Database
0            Datasets
1               inato
2          inato_data
3  information_schema
4               mysql
5  performance_schema
6                 sys

In [27]:
run_query("SELECT * FROM departments")

   dept_id        dept_name  manager_id     budget       location
0        1      Engineering         101  5000000.0       New York
1        2          Finance         102  2500000.0        Chicago
2        3  Human Resources         103  1200000.0         Boston
3        4        Marketing         104  2000000.0  San Francisco
4        5     Data Science         105  4000000.0        Seattle

In [26]:
run_query("SELECT * FROM employees")

,emp_id,emp_name,gender,hire_date,salary,dept_id,designation,performance_rating
0,1,Harman Talwar,M,2019-06-10,85000.0,1,Backend Engineer,5
1,2,Sahil Kapoor,M,2021-03-15,65000.0,1,Frontend Developer,4
2,3,Neha Sharma,F,2020-08-20,72000.0,5,Data Analyst,3
3,4,Priya Nair,F,2018-01-12,95000.0,2,Finance Lead,5
4,5,Rohan Mehta,M,2022-05-23,60000.0,3,HR Associate,4
5,6,Aditi Singh,F,2020-09-09,88000.0,1,DevOps Engineer,4
6,7,Rahul Verma,M,2017-04-02,110000.0,1,Tech Lead,5
7,8,Kavita Joshi,F,2019-11-18,78000.0,4,Marketing Specialist,3
8,9,Arjun Patel,M,2022-07-01,55000.0,3,Recruiter,2
9,10,Vanshika Rao,F,2021-01-25,82000.0,5,ML Engineer,4

In [20]:
run_query("SELECT * FROM projects")

,project_id,project_name,start_date,end_date,budget,dept_id,lead_id,status
0,1,E-Commerce Revamp,2023-01-01,None,1500000.0,1,7,Ongoing
1,2,Payroll Automation,2022-03-01,2023-01-31,800000.0,2,4,Completed
2,3,Recruitment Portal,2022-08-15,None,400000.0,3,5,Ongoing
3,4,Ad Campaign 2023,2023-02-01,2023-05-15,500000.0,4,8,Completed
4,5,Customer Segmentation,2023-04-10,None,1200000.0,5,10,Ongoing

1. List all employees along with their department names.

In [34]:
run_query(
'''
select e.emp_name, d.dept_name 
from employees e
join departments d
on e.dept_id = d.dept_id;   
'''
)

        emp_name        dept_name
0  Harman Talwar      Engineering
1   Sahil Kapoor      Engineering
2    Aditi Singh      Engineering
3    Rahul Verma      Engineering
4     Priya Nair          Finance
5    Rohan Mehta  Human Resources
6    Arjun Patel  Human Resources
7   Kavita Joshi        Marketing
8    Neha Sharma     Data Science
9   Vanshika Rao     Data Science

2. Find total salary paid by each department.

In [77]:
run_query(
'''
select d.dept_name, sum(e.salary) as total_salary_paid
from departments d
left join employees e
on d.dept_id = e.dept_id
group by d.dept_id; 
'''
)

         dept_name  total_salary_paid
0      Engineering           348000.0
1          Finance            95000.0
2  Human Resources           115000.0
3        Marketing            78000.0
4     Data Science           154000.0

3. Find department with the highest average salary.

In [72]:
run_query(
'''
select d.dept_name, avg(e.salary) as total_avg_salary
from departments d
join employees e
on d.dept_id = e.dept_id
group by d.dept_id
order by total_avg_salary desc
limit 1;
'''
)

  dept_name  total_avg_salary
0   Finance           95000.0

4. Get employees who joined after 2020 and are earning above their department’s average salary.

In [ ]:
run_query(
'''
select e.emp_id, e.emp_name, e.hire_date, e.salary, d.dept_name  
from employees e
join departments d on e.dept_id = d.dept_id
where year(e.hire_date) > 2020 and e.salary > (select avg(salary) from employees where dept_id = e.dept_id);
'''

)

   emp_id      emp_name   hire_date   salary        dept_name
0       5   Rohan Mehta  2022-05-23  60000.0  Human Resources
1      10  Vanshika Rao  2021-01-25  82000.0     Data Science

5. List all ongoing projects with their department and lead employee name.

In [80]:
run_query(
'''
select p.project_name, d.dept_name, e.emp_name, p.status
from projects p
join departments d on p.dept_id = d.dept_id
join employees e on p.lead_id = e.emp_id
where p.status = 'Ongoing';
'''
)

            project_name        dept_name      emp_name   status
0      E-Commerce Revamp      Engineering   Rahul Verma  Ongoing
1     Recruitment Portal  Human Resources   Rohan Mehta  Ongoing
2  Customer Segmentation     Data Science  Vanshika Rao  Ongoing

6. Count how many employees each department has, including departments with zero employees.

In [86]:
run_query(
'''
select d.dept_name, count(e.emp_id), group_concat(e.emp_name) as employees
from departments d
left join employees e 
on d.dept_id = e.dept_id
group by d.dept_id;
'''
)

,dept_name,count(e.emp_id),employees
0,Engineering,4,"Harman Talwar,Sahil Kapoor,Aditi Singh,Rahul V..."
1,Finance,1,Priya Nair
2,Human Resources,2,"Rohan Mehta,Arjun Patel"
3,Marketing,1,Kavita Joshi
4,Data Science,2,"Neha Sharma,Vanshika Rao"

7. Find departments that do not have any ongoing project.

In [88]:
run_query(
'''
select d.dept_name, p.status
from departments d
join projects p
on d.dept_id = p.dept_id
where p.status = 'completed'
'''
)

   dept_name     status
0    Finance  Completed
1  Marketing  Completed

8. Get employees whose salary is above the overall company average.

In [90]:

run_query(
'''
select emp_name, salary
from employees
where salary > (select avg(salary) from employees);
'''
)

        emp_name    salary
0  Harman Talwar   85000.0
1     Priya Nair   95000.0
2    Aditi Singh   88000.0
3    Rahul Verma  110000.0
4   Vanshika Rao   82000.0

9. Find employees who are leads of at least one project.

In [ ]:

run_query(
'''
select e.emp_name
from employees e
join projects p
on p.lead_id = e.emp_id
'''
)

       emp_name
0    Priya Nair
1   Rohan Mehta
2   Rahul Verma
3  Kavita Joshi
4  Vanshika Rao

10. Find the second highest salary in the company.

In [6]:

run_query(
'''
select salary
from employees
order by salary desc
limit 1 offset 1;
'''
)

    salary
0  95000.0

11. Find employees who earn the maximum salary within their department.

In [35]:

run_query(
'''

with salary_data as (select e.emp_name, d.dept_name, e.salary,
        max(e.salary) over(partition by d.dept_name) as max_salary
from employees e
join departments d
on e.dept_id = d.dept_id
)
select emp_name, dept_name, max_salary
from salary_data
where salary = max_salary
'''
)

       emp_name        dept_name  max_salary
0  Vanshika Rao     Data Science     82000.0
1   Rahul Verma      Engineering    110000.0
2    Priya Nair          Finance     95000.0
3   Rohan Mehta  Human Resources     60000.0
4  Kavita Joshi        Marketing     78000.0

12. List departments whose total budget is greater than the sum of all project budgets.

In [ ]:

run_query(
'''

'''
)

C. Window Functions (Analytical Queries)

Show each employee’s salary rank within their department.

In [5]:
run_query("""
select e.emp_name, d.dept_name, e.salary, 
        RANK() over(partition by d.dept_name order by e.salary desc) as ranking
        from employees e
        join departments d
        on e.dept_id = d.dept_id    
""")

        emp_name        dept_name    salary  ranking
0   Vanshika Rao     Data Science   82000.0        1
1    Neha Sharma     Data Science   72000.0        2
2    Rahul Verma      Engineering  110000.0        1
3    Aditi Singh      Engineering   88000.0        2
4  Harman Talwar      Engineering   85000.0        3
5   Sahil Kapoor      Engineering   65000.0        4
6     Priya Nair          Finance   95000.0        1
7    Rohan Mehta  Human Resources   60000.0        1
8    Arjun Patel  Human Resources   55000.0        2
9   Kavita Joshi        Marketing   78000.0        1

Calculate the running total of salary per department ordered by hire_date.

In [8]:
run_query("""
select e.emp_name, d.dept_name, e.hire_date, e.salary, 
        SUM(e.salary) over (partition by d.dept_name order by e.hire_date ) as running_total
        from employees e
        join departments d
        on e.dept_id = d.dept_id    
""")

        emp_name        dept_name   hire_date    salary  running_total
0    Neha Sharma     Data Science  2020-08-20   72000.0        72000.0
1   Vanshika Rao     Data Science  2021-01-25   82000.0       154000.0
2    Rahul Verma      Engineering  2017-04-02  110000.0       110000.0
3  Harman Talwar      Engineering  2019-06-10   85000.0       195000.0
4    Aditi Singh      Engineering  2020-09-09   88000.0       283000.0
5   Sahil Kapoor      Engineering  2021-03-15   65000.0       348000.0
6     Priya Nair          Finance  2018-01-12   95000.0        95000.0
7    Rohan Mehta  Human Resources  2022-05-23   60000.0        60000.0
8    Arjun Patel  Human Resources  2022-07-01   55000.0       115000.0
9   Kavita Joshi        Marketing  2019-11-18   78000.0        78000.0

Find top 2 employees in each department by performance rating.

In [39]:
run_query("""
with rank_by_performance as (
        select e.emp_name, d.dept_name, e.performance_rating, e.salary, 
        RANK() over (partition by d.dept_name order by e.performance_rating desc ) as rating 
        from employees e
        join departments d
        on e.dept_id = d.dept_id
)
select emp_name, dept_name, rating
from rank_by_performance
where rating <= 2
""")

        emp_name        dept_name  rating
0   Vanshika Rao     Data Science       1
1    Neha Sharma     Data Science       2
2  Harman Talwar      Engineering       1
3    Rahul Verma      Engineering       1
4     Priya Nair          Finance       1
5    Rohan Mehta  Human Resources       1
6    Arjun Patel  Human Resources       2
7   Kavita Joshi        Marketing       1


Find the difference between each employee’s salary and their department’s average salary.

In [11]:
run_query(
"""
with dept_avg as (select e.emp_name, d.dept_name, e.salary, 
        avg(e.salary) over (partition by d.dept_name) as avg_dept_salary
        from employees e
        join departments d
        on e.dept_id = d.dept_id   
)
select emp_name, dept_name, salary, avg_dept_salary,
(salary - avg_dept_salary) as diff_salary
from dept_avg
"""
)

        emp_name        dept_name    salary  avg_dept_salary  diff_salary
0    Neha Sharma     Data Science   72000.0          77000.0      -5000.0
1   Vanshika Rao     Data Science   82000.0          77000.0       5000.0
2  Harman Talwar      Engineering   85000.0          87000.0      -2000.0
3   Sahil Kapoor      Engineering   65000.0          87000.0     -22000.0
4    Aditi Singh      Engineering   88000.0          87000.0       1000.0
5    Rahul Verma      Engineering  110000.0          87000.0      23000.0
6     Priya Nair          Finance   95000.0          95000.0          0.0
7    Rohan Mehta  Human Resources   60000.0          57500.0       2500.0
8    Arjun Patel  Human Resources   55000.0          57500.0      -2500.0
9   Kavita Joshi        Marketing   78000.0          78000.0          0.0



🧩 D. Common Table Expressions (CTEs) & Recursive Queries


Using a CTE, show department-wise average salary and join it with department details.

In [18]:
run_query("""--sql
with dept_avg as (
    select d.dept_id, avg(e.salary) as avg_salary
    from departments d
    join employees e on d.dept_id = e.dept_id
    group by d.dept_id
)
select d.dept_id, d.dept_name, d.budget, d.location, da.avg_salary from departments d
join dept_avg da on d.dept_id = da.dept_id 
""")

   dept_id        dept_name     budget       location  avg_salary
0        1      Engineering  5000000.0       New York     87000.0
1        2          Finance  2500000.0        Chicago     95000.0
2        3  Human Resources  1200000.0         Boston     57500.0
3        4        Marketing  2000000.0  San Francisco     78000.0
4        5     Data Science  4000000.0        Seattle     77000.0


Recursive CTE: Generate a sequence of project years from 2020 to 2025.

In [27]:
run_query(
"""--sql
with recursive years(y) as (
    select 2020 
    union all
    select y + 1 from years where y < 2025
)
select y as project_year from years;
"""
)

   project_year
0          2020
1          2021
2          2022
3          2023
4          2024
5          2025


Find all employees hired before the average hire date using a CTE.

In [65]:
run_query(
"""--sql
with get_avg as (
select Date(from_days(avg(to_days(hire_date)))) as avg_date 
from employees
)
select * from employees 
where hire_date < (select avg_date from get_avg);
"""
)

,emp_id,emp_name,gender,hire_date,salary,dept_id,designation,performance_rating
0,1,Harman Talwar,M,2019-06-10,85000.0,1,Backend Engineer,5
1,4,Priya Nair,F,2018-01-12,95000.0,2,Finance Lead,5
2,7,Rahul Verma,M,2017-04-02,110000.0,1,Tech Lead,5
3,8,Kavita Joshi,F,2019-11-18,78000.0,4,Marketing Specialist,3

🧩 E. Date & Time Functions

Find employees who have worked for more than 4 years.

In [92]:
run_query(
"""--sql
select emp_name, hire_date, 
    timestampdiff(year, hire_date, current_date) as years_worked
from employees
where timestampdiff(year, hire_date, current_date) > 4
"""
)

        emp_name   hire_date  years_worked
0  Harman Talwar  2019-06-10             6
1    Neha Sharma  2020-08-20             5
2     Priya Nair  2018-01-12             7
3    Aditi Singh  2020-09-09             5
4    Rahul Verma  2017-04-02             8
5   Kavita Joshi  2019-11-18             5


Calculate project durations (in days) for completed projects.

In [75]:
run_query(
"""--sql
select project_name, start_date, end_date, datediff(end_date, start_date) as days
from projects
where status = "Completed"
"""
)

         project_name  start_date    end_date  days
0  Payroll Automation  2022-03-01  2023-01-31   336
1    Ad Campaign 2023  2023-02-01  2023-05-15   103

Find average duration of completed projects per department.

In [85]:
run_query(
"""--sql
select d.dept_name, p.project_name, avg(datediff(p.end_date, p.start_date)) as avg_duration
from departments d 
join projects p on d.dept_id = p.dept_id
where p.status = "Completed"
group by d.dept_id, p.project_name
"""
)

   dept_name        project_name  avg_duration
0    Finance  Payroll Automation         336.0
1  Marketing    Ad Campaign 2023         103.0

In [88]:
run_query(
"""--sql
SELECT dept_name, emp_name, salary
FROM (
    SELECT
        d.dept_name,e.emp_name,e.salary,
        ROW_NUMBER() OVER (PARTITION BY d.dept_name ORDER BY e.salary DESC) AS rn
    FROM
        employees e 
        join departments d on e.dept_id = d.dept_id
) AS rnk
WHERE rn = 1;
"""
)

         dept_name      emp_name    salary
0     Data Science  Vanshika Rao   82000.0
1      Engineering   Rahul Verma  110000.0
2          Finance    Priya Nair   95000.0
3  Human Resources   Rohan Mehta   60000.0
4        Marketing  Kavita Joshi   78000.0

🧩 F. Advanced Conditional Logic


Create a calculated column: Bonus = 10% of salary if rating >=4 else 5%.

In [97]:
run_query(
"""--sql
select emp_name, salary, performance_rating, 
    (case when performance_rating >= 4 then salary * 0.10 else salary * 0.05 end) as bonus
from employees      
"""
)

        emp_name    salary  performance_rating    bonus
0  Harman Talwar   85000.0                   5   8500.0
1   Sahil Kapoor   65000.0                   4   6500.0
2    Neha Sharma   72000.0                   3   3600.0
3     Priya Nair   95000.0                   5   9500.0
4    Rohan Mehta   60000.0                   4   6000.0
5    Aditi Singh   88000.0                   4   8800.0
6    Rahul Verma  110000.0                   5  11000.0
7   Kavita Joshi   78000.0                   3   3900.0
8    Arjun Patel   55000.0                   2   2750.0
9   Vanshika Rao   82000.0                   4   8200.0

Classify employees based on salary range: Low (<60k), Medium (60k–90k), High (>90k).

In [98]:
run_query(
"""--sql
select emp_name, salary, 
    case 
        when salary < 60000 then 'low'
        when salary between 60000 and 90000 then 'medium'
        when salary > 90000 then 'high'
    end as salary_level
from employees

"""
)

        emp_name    salary salary_level
0  Harman Talwar   85000.0       medium
1   Sahil Kapoor   65000.0       medium
2    Neha Sharma   72000.0       medium
3     Priya Nair   95000.0         high
4    Rohan Mehta   60000.0       medium
5    Aditi Singh   88000.0       medium
6    Rahul Verma  110000.0         high
7   Kavita Joshi   78000.0       medium
8    Arjun Patel   55000.0          low
9   Vanshika Rao   82000.0       medium

🧩 G. Views, Stored Functions & Triggers

Create a view active_projects showing only ongoing projects with department names.

In [118]:
run_command(
"""--sql
create or replace view active_projects as 
select p.project_id, p.project_name, d.dept_id, d.dept_name, e.emp_name as lead_name
from projects p
join departments d on p.dept_id = d.dept_id
join employees e on e.emp_id = p.lead_id
where p.status = "Ongoing"
"""
)

Query executed successfully

In [117]:
run_query(
"""--sql
SELECT * FROM active_projects ORDER BY project_id;
"""
)

   project_id           project_name  dept_id        dept_name     lead_name
0           1      E-Commerce Revamp        1      Engineering   Rahul Verma
1           3     Recruitment Portal        3  Human Resources   Rohan Mehta
2           5  Customer Segmentation        5     Data Science  Vanshika Rao


Create a stored function get_dept_budget_utilization(dept_id) → returns % of budget used by projects.

In [151]:
run_command(
"""--sql
# DROP FUNCTION IF EXISTS get_dept_budget_utilization;
CREATE FUNCTION get_dept_budget_utilization(in_dept INT)
RETURNS DECIMAL(6,2)
DETERMINISTIC
BEGIN
  DECLARE total_project_budget DECIMAL(14,2) DEFAULT 0;
  DECLARE dept_budget DECIMAL(14,2) DEFAULT 0;
  SELECT IFNULL(SUM(budget),0) INTO total_project_budget FROM projects WHERE dept_id = in_dept;
  SELECT IFNULL(budget,0) INTO dept_budget FROM departments WHERE dept_id = in_dept;
  IF dept_budget = 0 THEN
    RETURN 0.00;
  END IF;
  RETURN ROUND((total_project_budget / dept_budget) * 100, 2);
END;
"""
)
# use mao=p of googlw

Query executed successfully

In [ ]:
run_query(
"""--sql==
SELECT dept_id, dept_name, get_dept_budget_utilization(dept_id) AS budget_utilization_percent
FROM departments;
""")

   dept_id        dept_name     budget  budget_utilization_percent
0        1      Engineering  5000000.0                       30.00
1        2          Finance  2500000.0                       32.00
2        3  Human Resources  1200000.0                       33.33
3        4        Marketing  2000000.0                       25.00
4        5     Data Science  4000000.0                       30.00


Create a trigger that logs a message when a new employee is inserted.

In [ ]:
run_query(
"""--sql

"""
)


🧩 H. Performance & Optimization

Create an index on employees(salary) and explain the query plan before and after using EXPLAIN.

,id,select_type,table,partitions,type,possible_keys,key,key_len,ref,rows,filtered,Extra
0,1,SIMPLE,employees,None,ALL,None,None,None,None,10,33.33,Using where

In [ ]:
run_query(
"""--sql
SHOW INDEXES FROM employees;
"""
)

,Table,Non_unique,Key_name,Seq_in_index,Column_name,Collation,Cardinality,Sub_part,Packed,Null,Index_type,Comment,Index_comment,Visible,Expression
0,employees,0,PRIMARY,1,emp_id,A,10,None,None,,BTREE,,,YES,None
1,employees,1,dept_id,1,dept_id,A,5,None,None,YES,BTREE,,,YES,None

Use EXPLAIN ANALYZE to optimize a JOIN query between employees and projects.

In [ ]:
run_query(
"""--sql

"""
)

,Table,Non_unique,Key_name,Seq_in_index,Column_name,Collation,Cardinality,Sub_part,Packed,Null,Index_type,Comment,Index_comment,Visible,Expression
0,employees,0,PRIMARY,1,emp_id,A,10,None,None,,BTREE,,,YES,None
1,employees,1,dept_id,1,dept_id,A,5,None,None,YES,BTREE,,,YES,None
2,employees,1,idx_employees_salary,1,salary,A,10,None,None,YES,BTREE,,,YES,None
3,employees,1,idx_emp_salary,1,salary,A,10,None,None,YES,BTREE,,,YES,None
4,employees,1,idx_empl_salary,1,salary,A,10,None,None,YES,BTREE,,,YES,None


Partition the projects table by status and show how it improves query performance.

In [ ]:
run_query(
"""--sql

"""
)